export const explainData = [
  {
    orderNum: '1：',
    title: '什么是积分？',
    explain: '积分是有讲课堂用于奖励用户某些特定行为的分值，用户获得积分之后可以在有讲课堂平台使用积分。',
  },
  {
    orderNum: '2：',
    title: '如何查看积分？',
    explain: '用户可以在签到页面查看积分信息。',
  },
  {
    orderNum: '3：',
    title: '如何获得积分？',
    explain: '做任务赚积分：您可以通过【赚积分】页面查看积分任 务，完成任务即可获得相应积分。',
  },
  {
    orderNum: '4：',
    title: '积分的有效期是多久？',
    explain: '每年的12月31号为积分到期日，在到期日当天的24点， 您一年前获取且未使用的积分将会过期失效。即在2017 年12月31日，您在2016年12月31日之前（含）获得但未 兑换使用的积分将会过期失效。',
  },
  {
    orderNum: '5：',
    title: '积分如何使用？',
    explain: '积分可以在【积分兑换】中兑换丰富多彩的权益。',
  },
  {
    title: '温馨提示：',
    explain: '12.31日为积分到期日，如果用户在过期前使用此次即将过期积分兑换了权益并发生退回，退回的积分还是会被计算到当前即将过期的积分中。\n\n例如：\n'
    + '12-31到期，无论12-31之前退回，还是12-31之后退回，到期日都还是12-31，即不会变更这个到期日的。',
  },
];

export const promotionData = [
  {
    orderNum: '1：',
    title: '课程有哪些推广方式呢？',
    explain: 'a.使用海报进行推广：点击“生成海报”按钮，将您的推广海报分享给好友，好友通过扫描海报上的二维码购买课程即可推广；\n\nb.使用专属链接进行推广：将您的专属链接分享给好友，好友通过点击该链接购买课程即可推广。',
  },
  {
    orderNum: '2：',
    title: '怎么查看我的推广收益？',
    explain: '点击【我的】-> 点击【我的推广】。',
  },
  {
    orderNum: '3：',
    title: '怎么提现？',
    explain: '关注【唯库】公众号 -> 进入【个人中心】 -> 点击【奖学金】 -> 点击【去提现】',
  },
  {
    orderNum: '4：',
    title: '我可以通过购买自己的推广获取收益吗？',
    explain: '不可以。',
  },
];
